; domain
(define (domain progetto)
    (:requirements :strips :typing :disjunctive-preconditions :negative-preconditions :action-costs :equality)

    (:types
        cell - object
        tile - object
        tile_3 tile_5 tile_6 tile_7 tile_9 tile_a tile_b tile_c tile_d tile_e tile_f - tile
    )

    (:predicates
        ; per creare la griglia
        (is_above ?c1 - cell ?c2 - cell)
        (is_right ?c1 - cell ?c2 - cell)

        ; per indicare quali tile sono gia' state usate
        (used ?t - tile)

        ; per ridurre la complessita' delle precondizioni - senza questo predicato non funziona
        (has_tile ?c - cell)

        (open_left ?c - cell)
        (open_right ?c - cell)
        (open_above ?c - cell)
        (open_below ?c - cell)


        ; per indicare se abbiamo messo la prima tile
        (first_tile_positioned)

    )

    (:functions
        (total-cost)
    )


    ;############################################### TILE 3 ###############################################

    (:action place_tile_3
        :parameters (?c - cell ?t - tile_3)
        
        :precondition (and
            ; non ci deve essere una tile, in una casella o a dx o a sx ci deve essere o un oro o una tile,
            ; e se c'e' una tile a sx deve essere di tipo: { 3, 5, 7, 9, b, d, f }, se c'e' una tile a dx
            ; deve essere di tipo { 3, 6, 7, a, b, e, f }
                         
        

            ; t non deve essere gia' stata utilizzata
            (not (used ?t))
            
            ; non ci deve essere una tile su c
            (not (has_tile ?c))
            
            ; deve esserci almeno una cella c2 a dx o a sx con un oro o una tile
            (or
                ; o non abbiamo ancora messo nessuna tile
                (not (first_tile_positioned))

                ; oppure c'e' una cella o a dx o a sx che ha una tile, e se ci sono celle a dx o sx con tile
                ; devono essere tile appropriate
            
                (exists (?c2 - cell)
                    
                    (or
                        (and
                            (is_right ?c ?c2)
                            (open_right ?c2)
                        )
                        (and
                            (is_right ?c2 ?c)
                            (open_left ?c2)
                        )
                        
                    )
                        
                        
                )
                    ; se una cella c2 e' a dx o a sx e ha una tile, deve essere appropriata
                
            )

        )

        :effect (and
        
            (has_tile ?c)
            (open_right ?c)
            (open_left ?c)
            
            ; t e' usata
            (used ?t)


            ; segna che abbiamo messo (almeno) una tile
            (first_tile_positioned)


            (increase (total-cost) 6)
        )

    )

    


    ;############################################### TILE 5 ###############################################

    (:action place_tile_5
        :parameters (?c - cell ?t - tile_5)
        
        :precondition (and
            ; non ci deve essere una tile, in una casella a dx o sotto ci deve essere o un oro o una tile,
            ; e se c'e' una tile a dx deve essere di tipo: { 3, 6, 7, a, b, e, f }, se c'e' una tile sotto
            ; deve essere di tipo { 9, a, b, c, d, e, f }

        

            ; t non deve essere gia' stata utilizzata
            (not (used ?t))
            
            ; non ci deve essere una tile su c
            (not (has_tile ?c))


            (or
                ; o non abbiamo ancora messo nessuna tile
                (not (first_tile_positioned))

               
                ; deve esserci almeno una cella c2 a dx o sotto con un oro o una tile
                (exists (?c2 - cell)
                    
                    (or
                        (and
                            (is_right ?c2 ?c)
                            (open_left ?c2)  
                        )
                        (and
                            (is_above ?c ?c2)
                            (open_above ?c2)
                        )
                        
                        
                    )
                        
                        
                )

              
            )
        )

        :effect (and
            ; c'e' la tile t su c
            
            (has_tile ?c)
            (open_below ?c)
            (open_right ?c)

            ; t e' usata
            (used ?t)

            ; segna che la cella e' ok
              

            (first_tile_positioned)

             

            (increase (total-cost) 2)       
        )
    )



    ;############################################### TILE 6 ###############################################

    (:action place_tile_6
        :parameters (?c - cell ?t - tile_6)
        
        :precondition (and
            ; non ci deve essere una tile, in una casella a sx o sotto ci deve essere o un oro o una tile,
            ; e se c'e' una tile a sx deve essere di tipo: { 3, 5, 7, 9, b, d, f }, se c'e' una tile sotto
            ; deve essere di tipo { 9, a, b, c, d, e, f }

        

            ; t non deve essere gia' stata utilizzata
            (not (used ?t))
            
            ; non ci deve essere una tile su c
            (not (has_tile ?c))
            

            (or
                ; o non abbiamo ancora messo nessuna tile
                (not (first_tile_positioned))

                
                    ; deve esserci almeno una cella c2 a sx o sotto con un oro o una tile
                (exists (?c2 - cell)
                
                    (or
                        (and
                            (is_right ?c ?c2)                     
                            (open_right ?c2)
                        )
                        (and
                            (is_above ?c ?c2)
                            (open_above ?c2)
                        )
                        
                    )
                        
                )
                   
                
            )
        )

        :effect (and
            ; c'e' la tile t su c
            
            (has_tile ?c)
            (open_below ?c)
            (open_left ?c)

            ; t e' usata
            (used ?t)

            ; segna che la cella e' ok
              

            (first_tile_positioned)

             
            (increase (total-cost) 2)
            
        )
    )



    ;############################################### TILE 7 ###############################################


    (:action place_tile_7
        :parameters (?c - cell ?t - tile_7)
        
        :precondition (and
            ; non ci deve essere una tile, in una casella o a sx o dx o sotto ci deve essere o un oro o una tile,
            ; e se c'e' una tile a dx deve essere di tipo: { 3, 6, 7, a, b, e, f }, se c'e' una tile sotto
            ; deve essere di tipo { 9, a, b, c, d, e, f }, se c'e' una tile a sx deve essere di tipo:
            ; { 3, 5, 7, 9, b, d, f }

            ; t non deve essere gia' stata utilizzata
            (not (used ?t))

        
            
            ; non ci deve essere una tile su c
            (not (has_tile ?c))
    
            (or
                ; o non abbiamo ancora messo nessuna tile
                (not (first_tile_positioned))

               
                    ; deve esserci almeno una cella c2 a sx o dx o sotto con un oro o una tile
                (exists (?c2 - cell)
                    
                    (or
                        (and
                            (is_right ?c ?c2)     
                            (open_right ?c2)                     
                        )
                        (and
                            (is_right ?c2 ?c)
                            (open_left ?c2)
                        )
                        (and
                            (is_above ?c ?c2)
                            (open_above ?c2)
                        )
                        
                        
                        
                    )
                        
                )
                    ; o a sx o dx o sotto ci deve essere un oro o una tile
                  
            )
        )

        :effect (and
            ; c'e' la tile t su c
            
            (has_tile ?c)
            (open_below ?c)
            (open_left ?c)
            (open_right ?c)

            ; t e' usata
            (used ?t)

            ; segna che la cella e' ok
              

            (first_tile_positioned)

             

            (increase (total-cost) 8)
        )
    )


    
    ;############################################### TILE 9 ###############################################


    (:action place_tile_9
        :parameters (?c - cell ?t - tile_9)
        
        :precondition (and
            ; non ci deve essere una tile, in una casella o a dx o sopra ci deve essere o un oro o una tile,
            ; e se c'e' una tile a dx deve essere di tipo: { 3, 6, 7, a, b, e, f }, se c'e' una tile sopra
            ; deve essere: { 5, 6, 7, c, d, e, f }

            ; t non deve essere gia' stata utilizzata
            (not (used ?t))

        
            
            ; non ci deve essere una tile su c
            (not (has_tile ?c))
            

            (or
                ; o non abbiamo ancora messo nessuna tile
                (not (first_tile_positioned))

                
                    ; deve esserci almeno una cella c2 a dx o sopra con un oro o una tile
                (exists (?c2 - cell)
                    
                    (or

                        (and
                            (is_right ?c2 ?c)
                            (open_left ?c2)
                        )
                        (and
                            (is_above ?c2 ?c)
                            (open_below ?c2)
                        )
                        
                    )
                    
                )
                    ; o a dx o sopra ci deve essere un oro o una tile
                   
                
            )
        )

        :effect (and
            ; c'e' la tile t su c
            
            (has_tile ?c)
            (open_above ?c)
            (open_right ?c)

            ; t e' usata
            (used ?t)

            ; segna che la cella e' ok
              

            (first_tile_positioned)

            (increase (total-cost) 2)
        )
    )


    
    ;############################################### TILE A ###############################################

    (:action place_tile_a
        :parameters (?c - cell ?t - tile_a)
        
        :precondition (and
            ; non ci deve essere una tile, in una casella o a sx o sopra ci deve essere o un oro o una tile,
            ; e se c'e' una tile a sx deve essere di tipo:
            ; { 3, 5, 7, 9, b, d, f }, se c'e' una tile sopra deve essere: { 5, 6, 7, c, d, e, f }

        

            ; t non deve essere gia' stata utilizzata
            (not (used ?t))
            
            ; non ci deve essere una tile su c
            (not (has_tile ?c))

            (or
                ; o non abbiamo ancora messo nessuna tile
                (not (first_tile_positioned))

                
                    ; deve esserci almeno una cella c2 a sx o sopra con un oro o una tile
                (exists (?c2 - cell)
                    
                    (or
                        (and
                            (is_right ?c ?c2)
                            (open_right ?c2)
                        )
                        (and
                            (is_above ?c2 ?c)
                            (open_below ?c2)
                        )
                        
                    )
                        
                )
                    ; o a sx o sopra ci deve essere un oro o una tile
                    
                
            )
        )

        :effect (and
            ; c'e' la tile t su c
            
            (has_tile ?c)
            (open_above ?c)
            (open_left ?c)

            ; t e' usata
            (used ?t)

            ; segna che la cella e' ok
              

            (first_tile_positioned)

            (increase (total-cost) 2)
        )
    )



    
    ;############################################### TILE B ###############################################


    (:action place_tile_b
        :parameters (?c - cell ?t - tile_b)
        
        :precondition (and
            ; non ci deve essere una tile, in una casella o a sx o dx o sopra ci deve essere o un oro o una tile,
            ; e se c'e' una tile a dx deve essere di tipo: { 3, 6, 7, a, b, e, f }, se c'e' una tile a sx deve essere
            ; di tipo: { 3, 5, 7, 9, b, d, f }, se c'e' una tile sopra deve essere: { 5, 6, 7, c, d, e, f }

            ; t non deve essere gia' stata utilizzata
            (not (used ?t))

        
            
            ; non ci deve essere una tile su c
            (not (has_tile ?c))

            (or
                ; o non abbiamo ancora messo nessuna tile
                (not (first_tile_positioned))
            
               
                    ; deve esserci almeno una cella c2 a sx o dx o sopra con un oro o una tile
                (exists (?c2 - cell)
                    
                    (or
                        (and
                            (is_right ?c ?c2)
                            (open_right ?c2)
                        )
                        (and
                            (is_right ?c2 ?c)
                            (open_left ?c2)
                        )
                        (and
                            (is_above ?c2 ?c)
                            (open_below ?c2)
                        )
                        
                            
                    )
                        
                )
                    ; o a sx o dx o sopra ci deve essere un oro o una tile
                   
            )
        )

        :effect (and
            ; c'e' la tile t su c
            
            (has_tile ?c)
            (open_left ?c)
            (open_right ?c)
            (open_above ?c)

            ; t e' usata
            (used ?t)

            ; segna che la cella e' ok
              

            (first_tile_positioned)

             
            (increase (total-cost) 8)
           
        )
    )



    
    ;############################################### TILE C ###############################################

    (:action place_tile_c
        :parameters (?c - cell ?t - tile_c)
        
        :precondition (and
            ; non ci deve essere una tile, in una casella o sotto o sopra ci deve essere o un oro o una tile,
            ; e se c'e' una tile sotto deve essere di tipo { 9, a, b, c, d, e, f }, se c'e' una tile sopra
            ; deve essere: { 5, 6, 7, c, d, e, f }


        

            ; t non deve essere gia' stata utilizzata
            (not (used ?t))
            
            ; non ci deve essere una tile su c
            (not (has_tile ?c))

            (or
                ; o non abbiamo ancora messo nessuna tile
                (not (first_tile_positioned))
            
               
                    ; deve esserci almeno una cella sopra o sotto con un oro o una tile
                (exists (?c2 - cell)
                    
                    (or
                        (and
                            (is_above ?c2 ?c)
                            (open_below ?c2)
                        )
                        (and
                            (is_above ?c ?c2)
                            (open_above ?c2)
                        )
                        
                        
                    )
                        
                )
                    ; su ogni cella o sotto o sopra ci deve essere un oro o una tile appropriata
                    
            )
        )

        :effect (and
            ; c'e' la tile t su c
            
            (has_tile ?c)
            (open_above ?c)
            (open_below ?c)

            ; t e' usata
            (used ?t)

            ; segna che la cella e' ok
              

            (first_tile_positioned)

             
            (increase (total-cost) 6)
            
        )
    )


    
    ;############################################### TILE D ###############################################


    (:action place_tile_d
        :parameters (?c - cell ?t - tile_d)
        
        :precondition (and
            ; non ci deve essere una tile, in una casella o a dx o sotto o sopra ci deve essere o un oro o una tile,
            ; e se c'e' una tile a dx deve essere di tipo: { 3, 6, 7, a, b, e, f }, se c'e' una tile sotto
            ; deve essere di tipo { 9, a, b, c, d, e, f }, se c'e' una tile sopra deve essere: { 5, 6, 7, c, d, e, f }

        

            ; t non deve essere gia' stata utilizzata
            (not (used ?t))
            
            ; non ci deve essere una tile su c
            (not (has_tile ?c))

            (or
                ; o non abbiamo ancora messo nessuna tile
                (not (first_tile_positioned))
            
                
                    ; deve esserci almeno una cella a dx o sopra o sotto con un oro o una tile
                (exists (?c2 - cell)
                    
                    (or
                        (and
                            (is_right ?c2 ?c)
                            (open_left ?c2)
                        )
                        (and
                            (is_above ?c2 ?c)
                            (open_below ?c2)
                        )
                        (and
                            (is_above ?c ?c2)
                            (open_above ?c2)
                        )
                        
                        
                    )
                            
                )
                    ; o a dx o sotto o sopra ci deve essere un oro o una tile
                    
                       
            )
        )

        :effect (and
            ; c'e' la tile t su c
            
            (has_tile ?c)
            (open_below ?c)
            (open_above ?c)
            (open_right ?c)

            ; t e' usata
            (used ?t)

            ; segna che la cella e' ok
              

            (first_tile_positioned)

            (increase (total-cost) 8)
           
        )
    )


    
    ;############################################### TILE E ###############################################

    
    (:action place_tile_e
        :parameters (?c - cell ?t - tile_e)
        
        :precondition (and
            ; non ci deve essere una tile, in una casella o a sx o sotto o sopra ci deve essere o un oro o una tile,
            ; e se c'e' una tile sotto deve essere di tipo { 9, a, b, c, d, e, f }, se c'e' una tile a sx deve essere
            ; di tipo: { 3, 5, 7, 9, b, d, f }, se c'e' una tile sopra deve essere: { 5, 6, 7, c, d, e, f }

            ; t non deve essere gia' stata utilizzata
            (not (used ?t))

        
            
            ; non ci deve essere una tile su c
            (not (has_tile ?c))


            (or
                ; o non abbiamo ancora messo nessuna tile
                (not (first_tile_positioned))
            
                
                ; deve esserci almeno una cella a sx o sopra o sotto con un oro o una tile
                (exists (?c2 - cell)
                    
                    (or
                        (and
                            (is_right ?c ?c2)
                            (open_right ?c2)
                        )
                        (and
                            (is_above ?c2 ?c)
                            (open_below ?c2)
                        )
                        (and
                            (is_above ?c ?c2)
                            (open_above ?c2)
                        )
                        
                        
                        
                    )
                            
                )

                    ; o a sx o dx o sotto o sopra ci deve essere un oro o una tile
                   
            )
        )

        :effect (and
            ; c'e' la tile t su c
            
            (has_tile ?c)
            (open_left ?c)
            (open_above ?c)
            (open_below ?c)

            ; t e' usata
            (used ?t)

            ; segna che la cella e' ok
              

            (first_tile_positioned)

             
            (increase (total-cost) 8)   
            
        )
    )



    
    ;############################################### TILE F ###############################################


    (:action place_tile_f
        :parameters (?c - cell ?t - tile_f)
        
        :precondition (and
            ; non ci deve essere una tile, in una casella o a sx o dx o sotto o sopra ci deve essere o un oro o una tile,
            ; e se c'e' una tile a dx deve essere di tipo: { 3, 6, 7, a, b, e, f }, se c'e' una tile sotto
            ; deve essere di tipo { 9, a, b, c, d, e, f }, se c'e' una tile a sx deve essere di tipo:
            ; { 3, 5, 7, 9, b, d, f }, se c'e' una tile sopra deve essere: { 5, 6, 7, c, d, e, f }

            ; t non deve essere gia' stata utilizzata
            (not (used ?t))
            
            ; non ci deve essere una tile su c
            (not (has_tile ?c))


            (or
                ; o non abbiamo ancora messo nessuna tile
                (not (first_tile_positioned))
            
                
                    ; deve esserci almeno una cella a sx o dx o sopra o sotto con un oro o una tile
                (exists (?c2 - cell)
                
                    (or
                        (and
                            (is_right ?c ?c2)
                            (open_right ?c2)
                        )
                        (and
                            (is_right ?c2 ?c)
                            (open_left ?c2)
                        )
                        (and
                            (is_above ?c2 ?c)
                            (open_below ?c2)
                        )
                        (and
                            (is_above ?c ?c2)
                            (open_above ?c2)
                        )
                        
                        
                    )
                            
                )
                ; o a sx o dx o sotto o sopra ci deve essere un oro o una tile
                   
            )
        )

        :effect (and
            ; c'e' la tile t su c
            
            (has_tile ?c)
            (open_above ?c)
            (open_below ?c)
            (open_left ?c)
            (open_right ?c)

            ; t e' usata
            (used ?t)

            ; segna che la cella e' ok
              

            (first_tile_positioned)

            (increase (total-cost) 15)

        )
    )

)

; problem
(define (problem problem2)
	(:domain progetto)
	(:objects
		c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 c13 c14 c15 c16 c17 c18 c19 c20 c21 c22 c23 c24 c25 c26 c27 c28 c29 c30 c31 c32 c33 c34 c35 c36 c37 c38 c39 c40 c41 c42 c43 c44 c45 c46 c47 c48 c49 c50 c51 c52 c53 c54 c55 c56 c57 c58 c59 c60 c61 c62 c63 c64 c65 c66 c67 c68 c69 c70 c71 c72 c73 c74 c75 c76 c77 c78 c79 c80 c81 c82 c83 c84 c85 c86 c87 c88 c89 c90 c91 c92 c93 c94 c95 c96 - cell
		t3_1 t3_2 t3_3 t3_4 - tile_3
		t5_1 t5_2 t5_3 t5_4 t5_5 - tile_5
		t6_1 t6_2 t6_3 t6_4 t6_5 t6_6 - tile_6
		t7_1 t7_2 t7_3 t7_4 t7_5 - tile_7
		t9_1 t9_2 t9_3 t9_4 - tile_9
		ta_1 ta_2 ta_3 ta_4 ta_5 ta_6 - tile_a
		tb_1 tb_2 tb_3 - tile_b
		tc_1 tc_2 tc_3 tc_4 tc_5 tc_6 tc_7 - tile_c
		td_1 td_2 td_3 td_4 td_5 - tile_d
		te_1 te_2 te_3 te_4 - tile_e
		tf_1 tf_2 tf_3 - tile_f
	)
	(:init
		(is_above c1 c9)
		(is_above c2 c10)
		(is_above c3 c11)
		(is_above c4 c12)
		(is_above c5 c13)
		(is_above c6 c14)
		(is_above c7 c15)
		(is_above c8 c16)
		(is_above c9 c17)
		(is_above c10 c18)
		(is_above c11 c19)
		(is_above c12 c20)
		(is_above c13 c21)
		(is_above c14 c22)
		(is_above c15 c23)
		(is_above c16 c24)
		(is_above c17 c25)
		(is_above c18 c26)
		(is_above c19 c27)
		(is_above c20 c28)
		(is_above c21 c29)
		(is_above c22 c30)
		(is_above c23 c31)
		(is_above c24 c32)
		(is_above c25 c33)
		(is_above c26 c34)
		(is_above c27 c35)
		(is_above c28 c36)
		(is_above c29 c37)
		(is_above c30 c38)
		(is_above c31 c39)
		(is_above c32 c40)
		(is_above c33 c41)
		(is_above c34 c42)
		(is_above c35 c43)
		(is_above c36 c44)
		(is_above c37 c45)
		(is_above c38 c46)
		(is_above c39 c47)
		(is_above c40 c48)
		(is_above c41 c49)
		(is_above c42 c50)
		(is_above c43 c51)
		(is_above c44 c52)
		(is_above c45 c53)
		(is_above c46 c54)
		(is_above c47 c55)
		(is_above c48 c56)
		(is_above c49 c57)
		(is_above c50 c58)
		(is_above c51 c59)
		(is_above c52 c60)
		(is_above c53 c61)
		(is_above c54 c62)
		(is_above c55 c63)
		(is_above c56 c64)
		(is_above c57 c65)
		(is_above c58 c66)
		(is_above c59 c67)
		(is_above c60 c68)
		(is_above c61 c69)
		(is_above c62 c70)
		(is_above c63 c71)
		(is_above c64 c72)
		(is_above c65 c73)
		(is_above c66 c74)
		(is_above c67 c75)
		(is_above c68 c76)
		(is_above c69 c77)
		(is_above c70 c78)
		(is_above c71 c79)
		(is_above c72 c80)
		(is_above c73 c81)
		(is_above c74 c82)
		(is_above c75 c83)
		(is_above c76 c84)
		(is_above c77 c85)
		(is_above c78 c86)
		(is_above c79 c87)
		(is_above c80 c88)
		(is_above c81 c89)
		(is_above c82 c90)
		(is_above c83 c91)
		(is_above c84 c92)
		(is_above c85 c93)
		(is_above c86 c94)
		(is_above c87 c95)
		(is_above c88 c96)

		(is_right c2 c1)
		(is_right c3 c2)
		(is_right c4 c3)
		(is_right c5 c4)
		(is_right c6 c5)
		(is_right c7 c6)
		(is_right c8 c7)
		(is_right c10 c9)
		(is_right c11 c10)
		(is_right c12 c11)
		(is_right c13 c12)
		(is_right c14 c13)
		(is_right c15 c14)
		(is_right c16 c15)
		(is_right c18 c17)
		(is_right c19 c18)
		(is_right c20 c19)
		(is_right c21 c20)
		(is_right c22 c21)
		(is_right c23 c22)
		(is_right c24 c23)
		(is_right c26 c25)
		(is_right c27 c26)
		(is_right c28 c27)
		(is_right c29 c28)
		(is_right c30 c29)
		(is_right c31 c30)
		(is_right c32 c31)
		(is_right c34 c33)
		(is_right c35 c34)
		(is_right c36 c35)
		(is_right c37 c36)
		(is_right c38 c37)
		(is_right c39 c38)
		(is_right c40 c39)
		(is_right c42 c41)
		(is_right c43 c42)
		(is_right c44 c43)
		(is_right c45 c44)
		(is_right c46 c45)
		(is_right c47 c46)
		(is_right c48 c47)
		(is_right c50 c49)
		(is_right c51 c50)
		(is_right c52 c51)
		(is_right c53 c52)
		(is_right c54 c53)
		(is_right c55 c54)
		(is_right c56 c55)
		(is_right c58 c57)
		(is_right c59 c58)
		(is_right c60 c59)
		(is_right c61 c60)
		(is_right c62 c61)
		(is_right c63 c62)
		(is_right c64 c63)
		(is_right c66 c65)
		(is_right c67 c66)
		(is_right c68 c67)
		(is_right c69 c68)
		(is_right c70 c69)
		(is_right c71 c70)
		(is_right c72 c71)
		(is_right c74 c73)
		(is_right c75 c74)
		(is_right c76 c75)
		(is_right c77 c76)
		(is_right c78 c77)
		(is_right c79 c78)
		(is_right c80 c79)
		(is_right c82 c81)
		(is_right c83 c82)
		(is_right c84 c83)
		(is_right c85 c84)
		(is_right c86 c85)
		(is_right c87 c86)
		(is_right c88 c87)
		(is_right c90 c89)
		(is_right c91 c90)
		(is_right c92 c91)
		(is_right c93 c92)
		(is_right c94 c93)
		(is_right c95 c94)
		(is_right c96 c95)


		(= (total-cost) 0)
	)
	(:goal
		(and
			(has_tile c10)
			(has_tile c47)
			(has_tile c96)
		)
	)
	(:metric
		minimize (total-cost)
	)
)

; plan
1. (place_tile_3 c47 t3_1)
   added: (has_tile c47) (open_right c47) (open_left c47) (used t3_1) (first_tile_positioned)
   goals met: 1 of 3
2. (place_tile_6 c48 t6_1)
   added: (has_tile c48) (open_below c48) (open_left c48) (used t6_1)
   goals met: 1 of 3
3. (place_tile_c c56 tc_1)
   added: (has_tile c56) (open_above c56) (open_below c56) (used tc_1)
   goals met: 1 of 3
4. (place_tile_c c64 tc_2)
   added: (has_tile c64) (open_above c64) (open_below c64) (used tc_2)
   goals met: 1 of 3
5. (place_tile_c c72 tc_3)
   added: (has_tile c72) (open_above c72) (open_below c72) (used tc_3)
   goals met: 1 of 3
6. (place_tile_c c80 tc_4)
   added: (has_tile c80) (open_above c80) (open_below c80) (used tc_4)
   goals met: 1 of 3
7. (place_tile_c c88 tc_5)
   added: (has_tile c88) (open_above c88) (open_below c88) (used tc_5)
   goals met: 1 of 3
8. (place_tile_9 c96 t9_1)
   added: (has_tile c96) (open_above c96) (open_right c96) (used t9_1)
   goals met: 2 of 3
9. (place_tile_3 c46 t3_2)
   added: (has_tile c46) (open_right c46) (open_left c46) (used t3_2)
   goals met: 2 of 3
10. (place_tile_9 c45 t9_2)
   added: (has_tile c45) (open_above c45) (open_right c45) (used t9_2)
   goals met: 2 of 3
11. (place_tile_6 c37 t6_2)
   added: (has_tile c37) (open_below c37) (open_left c37) (used t6_2)
   goals met: 2 of 3
12. (place_tile_9 c36 t9_3)
   added: (has_tile c36) (open_above c36) (open_right c36) (used t9_3)
   goals met: 2 of 3
13. (place_tile_6 c28 t6_3)
   added: (has_tile c28) (open_below c28) (open_left c28) (used t6_3)
   goals met: 2 of 3
14. (place_tile_9 c27 t9_4)
   added: (has_tile c27) (open_above c27) (open_right c27) (used t9_4)
   goals met: 2 of 3
15. (place_tile_6 c19 t6_4)
   added: (has_tile c19) (open_below c19) (open_left c19) (used t6_4)
   goals met: 2 of 3
16. (place_tile_b c18 tb_1)
   added: (has_tile c18) (open_left c18) (open_right c18) (open_above c18) (used tb_1)
   goals met: 2 of 3
17. (place_tile_7 c10 t7_1)
   added: (has_tile c10) (open_below c10) (open_left c10) (open_right c10) (used t7_1)
   goals met: 3 of 3
